Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This variable can be used to get or to set the height of the specified view port.
zh_cn: 此变量可用于获取或设置指定视图端口的高度。

source: This variable can be used to get or to set the position of an instance along its current path in the previous step, and is a normalised value between 0 and 1 ie: 0 is the start position of the path and 1 would be the end position.
zh_cn: 该变量可用于获取或设置实例在上一步中沿其当前路径的位置，是一个介于0和1之间的标准化值，即:0是路径的起始位置，1是结束位置。

source: This variable can be used to get or to set the width of the specified view port.
zh_cn: 此变量可用于获取或设置指定视口的宽度。

source: This variable can be used to set the angular damping of the instance, or it can be used to get the current angular damping.
zh_cn: 这个变量可以用来设置实例的角阻尼，也可以用来获取当前的角阻尼。

source: This variable can be used to set the angular velocity of the instance, or it can be used to get the current angular velocity, in degrees per second and the value used can be either positive (for clockwise rotation) or negative (for anticlockwise rotation).
zh_cn: 该变量可用于设置实例的角速度，也可用于获取当前角速度，单位为度/秒，使用的值可以为正(用于顺时针旋转)或负(用于逆时针旋转)。

source: This variable can be used to set the linear damping of the instance, or it can be used to get the current linear damping.
zh_cn: 此变量可用于设置实例的线性阻尼，也可用于获取当前的线性阻尼。

source: This variable can be used to set whether or not the instance can be affected by rotational forces (default is false).
zh_cn: 此变量可用于设置实例是否会受到旋转力的影响(默认值为false)。

source: This variable controls the "tinting" of the instance sprite and the default value is -1 (but can also be c_white).
zh_cn: 这个变量控制实例精灵的"着色"，默认值是-1(也可以是c_white)。

source: This variable controls whether any view ports that are visible within the room are enabled or not.
zh_cn: 此变量控制是否启用房间内可见的任何视图端口。

source: This variable controls whether or not the instance is currently "active".
zh_cn: 该变量控制实例当前是否"激活(active)"。

source: This variable defines whether or not the instance is extremely fast moving (for example a bullet).
zh_cn: 这个变量定义实例是否快速移动(例如子弹)。

source: This variable determines the speed in which GameMaker will cycle through the sub-images for the current instance sprite.
zh_cn: 这个变量决定了GameMaker在当前实例精灵的子图像中循环的速度。

source: This variable holds a string containing the last (at most) 1024 characters typed on the keyboard.
zh_cn: 该变量保存一个字符串，该字符串包含键盘上输入的最后(最多)1024个字符。

source: This variable holds current state of the assigned time line and will return true if it is running and false if it is not.
zh_cn: 该变量保存所分配时间线的当前状态，如果正在运行则返回true，如果没有运行则返回false。

source: This variable holds the current orientation of the path that has been assigned to the instance when the function path_start() was called.
zh_cn: 该变量保存调用函数path_start()时分配给实例的路径的当前方向。

source: This variable holds the current position (moment) a time line is currently at.
zh_cn: 该变量保存时间线当前所处的当前位置(时刻)。

source: This variable holds the height (in pixels) of the browser the game is being run in.
zh_cn: 这个变量保存游戏运行时浏览器的高度(以像素为单位)。

source: This variable holds the height of the current room in pixels.
zh_cn: 该变量以像素为单位保存当前房间的高度。

source: This variable holds the index of the time line currently associated with the instance.
zh_cn: 此变量保存当前与实例关联的时间线的索引。

source: This variable holds the room index for the current room that your game is running.
zh_cn: 这个变量保存了你的游戏正在运行的当前房间的房间索引。

source: This variable holds the width (in pixels) of the browser the game is being run in.
zh_cn: 这个变量保存游戏运行时浏览器的宽度(以像素为单位)。

source: This variable holds the width of the current room in pixels.
zh_cn: 这个变量保存当前房间的宽度(以像素为单位)。

source: This variable is global in scope and is used to hold a DS Map when used in the Gesture Events, and -1 at all other times.
zh_cn: 该变量在范围上是全局的，当在手势事件中使用时用于保存DS map，在所有其他时间为-1。

source: This variable is not read only and you can change it, for example to set it to "" (an empty string) if you handled it already, and you can use the String Functions to manipulate it.
zh_cn: 此变量不是只读的，您可以更改它，例如，如果您已经处理过它，可以将其设置为""(空字符串)，并且您可以使用字符串函数来操作它。

source: This variable is not read only and you can change it, for example to set it to "" (an empty string) if you handled it already.
zh_cn: 此变量不是只读的，您可以更改它，例如，如果您已经处理过它，可以将其设置为""(空字符串)。

source: This variable is not read only and you can change it, for example to set it to -1 if you handled it already.
zh_cn: 这个变量不是只读的，您可以更改它，例如，如果您已经处理了它，就将其设置为-1。

source: This variable is the physics equivalent of the instance variable x.
zh_cn: 这个变量是实例变量x的物理等价物。

source: This variable is the physics equivalent of the instance variable y.
zh_cn: 这个变量是实例变量y的物理等价物。

source: This variable is used to get or to set the alpha value for the sprite.
zh_cn: 该变量用于获取或设置精灵的透明度(Alpha)值。

source: This variable refers to the value that keyboard_key was in the previous frame, returning the keycode of that key (all standard keycode constants are returned).
zh_cn: 这个变量指的是keyboard_key在前一帧中的值，返回那个键的键码(返回所有标准的键码常量)。

source: This variable returns the index of the current sprite for the instance, or -1 if the instance has no sprite associated with it.
zh_cn: 该变量返回实例的当前精灵的索引，如果实例没有与之关联的精灵，则返回-1。

source: This variable returns the last mouse button that was pressed and can return any of the special mouse constants except mb_any (you may also set this variable to one of the constants).
zh_cn: 该变量返回最后一次按下的鼠标按钮，并且可以返回除mb_any之外的任何特殊鼠标常量(您也可以将该变量设置为其中一个常量)。

source: This variable stores a string of the last key pressed.
zh_cn: 该变量存储最后一次按键的字符串。

source: This variable stores the initial x position of the instance when it is first created in the room.
zh_cn: 此变量存储实例在房间中首次创建时的初始x位置。

source: This variable stores the initial y position of the instance when it is first created in the room.
zh_cn: 此变量存储实例在房间中首次创建时的初始y位置。

source: This variable will be set just before the start of the begin step event but it can also be set through code at any time, meaning you can give it your own custom value should that be necessary.
zh_cn: 该变量将在begin step事件开始之前设置，但也可以在任何时候通过代码设置，这意味着如果有必要，您可以给它自己的自定义值。

source: This variable will be set to the current x position just before the start of the begin step event but it can also be set through code at any time, meaning you can give it your own custom value should that be necessary.
zh_cn: 这个变量将在begin step事件开始之前被设置为当前的x位置，但是它也可以在任何时候通过代码来设置，这意味着如果有必要的话，您可以给它自己的自定义值。

source: This variable will return whether the time line is looping (true) or not (false).
zh_cn: 这个变量将返回时间线是否循环(true)或非循环(false)。

source: This variable will tell you the version number for the OS that is running your game.
zh_cn: 这个变量会告诉你运行游戏的操作系统的版本号。

source: This very useful function only returns integers (whole numbers).
zh_cn: 这个非常有用的函数只返回整数(整数)。

source: This width is returned in pixels and will be dependent on the image_xscale.
zh_cn: 该宽度以像素为单位返回，并将依赖于image_xscale。

source: This will accept any number as, unlike dtan(), darctan() asymptotes are on the y axis so it just means you'll never get returned a number greater than 90 or less than -90.
zh_cn: 这将接受任何数字，因为与dtan()不同，darctan()渐近线在y轴上，所以这意味着您永远不会返回大于90或小于-90的数字。

source: This will accept any number as, unlike tan(), arctan() asymptotes are on the y axis so it just means you'll never get returned a number greater than pi/2 or less than -pi/2.
zh_cn: 这将接受任何数字，不像tan()，arctan()渐近线在y轴上，所以这意味着你永远不会返回大于 pi/2 或小于 -pi/2 的数字。

source: This will also remove all vertex data for any custom primitives that it contained.
zh_cn: 这也将删除它所包含的任何自定义图元的所有顶点数据。

source: This will also stop any particles that are being streamed from the emitter at the time, and if you wish to use the emitter again you will need to set the region position and particle type using the part_emitter_region() function.
zh_cn: 这也将停止当时从发射器流出的任何粒子，如果您希望再次使用发射器，您将需要使用part_emitter_region()函数设置区域位置和粒子类型。

source: This will be a value from 0 to 6.
zh_cn: 这将是一个从0到6的值。

source: This will build a 4x4 identity matrix with the following structure:
zh_cn: 这将构建一个具有以下结构的4x4标识矩阵:

source: This will clear all particles that are currently visible in the room which have been made using either effect_create_above() or effect_create_below().
zh_cn: 这将清除房间中当前可见的所有使用effect_create_above()或effect_create_below()制作的粒子。

source: This will duplicate a given room and return the duplicates index to be used in all further calls to reference the new room.
zh_cn: 这将复制给定的房间并返回重复索引，以便在引用新房间的所有后续调用中使用。

source: This will include the instance running the code, but does not include those instances that have been deactivated using the instance deactivate functions.
zh_cn: 这将包括运行代码的实例，但不包括那些已使用实例停用函数停用的实例。

source: This will not happen instantaneously, but rather at the end of the current step, so any code you have in the same step after this function has been called will still run.
zh_cn: 这不会立即发生，而是在当前步骤的末尾发生，因此调用此函数后在同一步骤中的任何代码仍将运行。

source: This will not, and should not, be displayed, but it will save correctly to disk for use in encoding.
zh_cn: 这不会也不应该显示出来，但是它会正确地保存到磁盘上，以便在编码时使用。

source: This will open the specified URL on the browser of the chosen target device, or, if you are using the HTML5 module, in the currently open browser.
zh_cn: 这将在所选目标设备的浏览器上打开指定的URL，或者(如果使用HTML5模块)在当前打开的浏览器中打开。

source: This will remove it from the room until the room is restarted (unless the room is persistent).
zh_cn: 这将从房间中删除它，直到重新启动房间(除非房间是持久的)。

source: This will return (or set) the oscillation frequency for the joint, in hertz, and typically the frequency should be less than a half the frequency of the time step, as set by the function physics_world_update_speed().
zh_cn: 这将返回(或设置)关节的振荡频率，单位为赫兹，通常该频率应小于时间步长频率的一半，由函数physics_world_update_speed()设置。

source: This will return the directory where the game executable is stored.
zh_cn: 这将返回存储游戏可执行文件的目录。

source: This will return the length of the joint from the first local x/y coordinates to the first anchor x/y coordinates (Distance joints only, can only be read from)
zh_cn: 这将返回从第一个局部x/y坐标到第一个锚点x/y坐标的关节长度(仅关节距离，只能从读取)

source: This will return the length of the joint from the second local x/y coordinates to the second anchor x/y coordinates (Distance joints only, can only be written to)
zh_cn: 这将返回关节从第二个局部x/y坐标到第二个锚点x/y坐标的长度(仅关节距离，只能写入)

source: This will return the value of a number multiplied by itself "n" number of times.
zh_cn: 这将返回一个数字乘以自身"n"次的值。

source: This will stop all further achievements and scores from being recorded.
zh_cn: 这将阻止所有进一步的成就和分数被记录。

source: This will work for precise collisions, but only if both the instance and the instances of the object being checked for have precise collision masks selected, otherwise only bounding box collisions are applied.
zh_cn: 这将适用于精确碰撞，但仅当实例和被检查对象的实例都选择了精确碰撞遮罩时，否则仅应用边界框碰撞。

source: This will work for precise collisions, but only if both the instance and the object being checked for have precise collision masks selected otherwise only bounding box collisions are applied.
zh_cn: 这将适用于精确碰撞，但只有在实例和正在检查的对象都选择了精确碰撞遮罩的情况下，否则仅应用边界框碰撞。

source: This works by taking the maximum input values for force and torque and applying those to the second fixture to bring the speed and angular momentum down to the same values as that of the first instance.
zh_cn: 其工作原理是，取力和扭矩的最大输入值，并将其应用于第二个夹具，使速度和角动量下降到与第一个实例相同的值。

source: This works by telling GameMaker to skip the draw event for this instance, so care must be taken when using this as it means that no code placed in the draw event will be run while the instance is not visible.
zh_cn: 这是通过告诉GameMaker跳过这个实例的draw事件来实现的，所以在使用时必须小心，因为这意味着当实例不可见时，放置在draw事件中的任何代码都不会运行。

source: This xoffset is returned in pixels and will be dependent on the image_xscale, so that (for example) if a square 32x32 sprite is defined as having the x origin at 16, when that sprite is scaled by 2 this variable will return 32.
zh_cn: 这个xoffset以像素为单位返回，并将依赖于image_xscale，因此(例如)如果一个正方形的32x32精灵被定义为x原点为16，当这个精灵被缩放2时，这个变量将返回32。

source: This yoffset is returned in pixels and will be dependent on the image_yscale, so that (for example) if a square 32x32 sprite is defined as having the y origin at 16, when that sprite is scaled by 2 this variable will return 32.
zh_cn: 这个yoffset以像素为单位返回，并将依赖于image_yscale，因此(例如)如果一个正方形的32x32精灵被定义为y原点为16，当这个精灵被缩放2时，这个变量将返回32。

source: Three floating point values
zh_cn: 三个浮点值

source: Tiling is based on the width and height of the sprite as defined by the sprite variables of the instance running the code.
zh_cn: 平铺基于运行代码的实例的精灵变量所定义的精灵的宽度和高度。

source: Tizen mobile device browser
zh_cn: Tizen移动设备浏览器

source: To add moments to a timeline created in this way, see the function timeline_moment_add_script().
zh_cn: 要向以这种方式创建的时间轴添加时刻，请参见函数timeline_moment_add_script()。

source: To add more versatility to the audio engine, GameMaker permits you to select the falloff model that suits your game.
zh_cn: 为了给音频引擎添加更多的功能，GameMaker允许你选择适合你的游戏的衰减模型。

source: To combine strings you can use + (see example below) and you can also use \n within a string to add a line break so it is drawn over multiple lines (for information on how to properly format a string and what escape characters you can use, please see here).
zh_cn: 要组合字符串，可以使用+(参见下面的例子)，也可以在字符串中使用\n来添加换行符，这样就可以在多行上绘制换行符(有关如何正确格式化字符串以及可以使用哪些转义字符的信息，请参阅这里)。

source: To do this we calculate the log2(x) of the number, round it down and add 1 - for example log2(100) returns 6.643856, which rounded down is 6, to which we add one and it gives us 7.
zh_cn: 为此，我们计算该数字的log2(x ),将其向下舍入并加1 -例如，log2(100)得出6.643856，向下舍入后为6，再加1，得到7。

source: To do this you choose a key that you want to map (key2 - this will be the key that you write the code for) and a key that you want it to be mapped to (key1).
zh_cn: 为此，您需要选择一个想要映射的键(key 2——这将是您编写代码的键)和一个想要映射到的键(key1)。

source: To do this, you need tell it which part of the system to draw, and this is done by passing a value created from the bits stored in various "flag" constants:
zh_cn: 为此，您需要告诉它要绘制系统的哪一部分，这是通过传递由存储在各种"标志"常量中的位创建的值来完成的:

source: To end and draw the primitive you must call draw_primitive_end().
zh_cn: 要结束并绘制图元，必须调用draw_primitive_end()。

source: To generate a random number GameMaker starts with a random seed number.
zh_cn: 为了生成随机数，GameMaker从一个随机种子数开始。

source: To get the true fps, ie.
zh_cn: 以获得真实的fps，即。

source: To have all particles with the same lifetime, set the two values to be the same.
zh_cn: 要使所有粒子具有相同的寿命，请将这两个值设置为相同。

source: To help avoid this, a precision value is used on all real number functions, and when the difference between two numbers is smaller than this precision they are considered equal.
zh_cn: 为了避免这种情况，对所有实数函数都使用一个精度值，当两个数之间的差小于这个精度时，它们被认为是相等的。

source: To instantly change the gain, simply set the time argument to 0.
zh_cn: 要立即更改增益，只需将time参数设置为0。

source: To maintain the texture appearance while changing only the alpha, a value of -1 (or c_white) may be used for the colour argument.
zh_cn: 为了在只改变alpha值的情况下保持纹理外观，color参数可以使用-1(或c_white)值。

source: To make one you need to have previously defined your fixtures and created the two basic joints that are going to comprise your gear - these must be made up of one revolute joint and either a prismatic joint or another revolute joint.
zh_cn: 要做一个你需要预先定义你的夹具和创建两个基本的关节，将组成你的齿轮 -这些必须由一个转动关节和一个移动关节或另一个转动关节组成。

source: To optimise performance when drawing circles, GameMaker basically draws a polygon shape with enough sides to make it appear circular.
zh_cn: 为了优化绘制圆形时的性能，GameMaker基本上绘制了一个具有足够边的多边形形状，使其看起来像圆形。

source: To prevent this, you can set the mix value between two animation sets and the sprite will interpolate between them.
zh_cn: 为了防止这种情况，你可以在两个动画集之间设置混合值，然后精灵就会在它们之间进行插值。

source: To remove the cursor sprite, you can set this variable to -1 again.
zh_cn: 要删除光标精灵，您可以再次将此变量设置为-1。

source: To resolve this issue, you will need to set the texture page settings (in the Texture Group Editor) to disable the Automatic Crop.
zh_cn: 要解决这个问题，你需要设置纹理页面设置(在纹理组编辑器中)禁用自动裁剪。

source: To specify a revolute you need to provide two instances and a single anchor point in the room, as you can see in the image provided:
zh_cn: 要指定一个旋转，你需要在房间中提供两个实例和一个锚点，如图所示:

source: To that end we use the function physics_world_update_speed() which sets the update speed for the physics system independently of the room speed.
zh_cn: 为此，我们使用函数physics_world_update_speed()来设置物理系统的更新速度，与房间速度无关。

source: To that end, you must have defined the canvas element correctly within the *.html page of your game using the correct sizes and names that correspond to the surfaces you wish to create.
zh_cn: 为此，你必须在游戏的*.html页面中正确定义canvas元素，使用与你想要创建的表面相对应的正确大小和名称。

source: To use this you need to specify an already created buffer, the offset value (which is the point within the buffer at which you wish to start encoding) as well as the size, in bytes, of the buffer memory to encode.
zh_cn: 要使用它，您需要指定一个已经创建的缓冲区、偏移值(缓冲区中您希望开始编码的点)以及要编码的缓冲区内存的大小(以字节为单位)。

source: Toggle vertical synchronisation to on (true) or off (false).
zh_cn: 将垂直同步切换到开(true)或关(false)。

source: Top button 1 (this maps to the "A" on an Xbox 360 controller and the cross on a PS controller)
zh_cn: 顶部按钮1(对应Xbox 360控制器上的"A"和PS控制器上的"十字")

source: Top button 2 (this maps to the "B" on an Xbox 360 controller and the circle on a PS controller)
zh_cn: 顶部按钮2(对应Xbox 360控制器上的"B"和PS控制器上的圆)

source: Top button 3 (this maps to the "X" on an Xbox 360 controller and the square on a PS controller)
zh_cn: 顶部按钮3(对应Xbox 360控制器上的"X"和PS控制器上的方块)

source: Top button 4 (this maps to the "Y" on an Xbox 360 controller and the triangle on a PS controller)
zh_cn: 顶部按钮4(对应Xbox 360控制器上的"Y"和PS控制器上的三角形)

source: Turns a real number into a string using your own formatting, where you can choose how many "places" are saved to the string and how many decimal places are saved also.
zh_cn: 使用您自己的格式将一个实数转换成一个字符串，您可以选择将多少位保存到字符串中，以及将多少位小数保存到字符串中。

source: Two floating point values
zh_cn: 两个浮点值

source: Two quick touches/clicks and releases have been detected anywhere in the room
zh_cn: 在房间的任何地方都检测到两次快速触摸/点击和释放

source: Two quick touches/clicks and releases have been detected for an instance
zh_cn: 对一个实例检测到两个快速触摸/单击和释放

source: Two touches and a straight movement have been detected anywhere in the room
zh_cn: 在房间的任何地方都检测到两次触摸和直线运动

source: Two touches and a straight movement have been detected for an instance
zh_cn: 对于一个实例，检测到两次触摸和直线运动

source: UDP is "connectionless" in that you don't actually do a connect, you just send a packet directly to an IP, and the server gets incoming data from an IP address and has to deal with it "as is".
zh_cn: UDP是"无连接"的，因为你实际上不进行连接，你只是直接向一个IP发送数据包，服务器从一个IP地址获得传入的数据，并必须"按原样"处理它。

source: UV coordinates (u, v)
zh_cn: UV坐标 (u, v)

source: Undefined will be returned if no preferences have been set.
zh_cn: 如果没有设置首选项，将返回Undefined。

source: Unknown OS
zh_cn: 未知的系统

source: Unknown browser
zh_cn: 未知的浏览器

source: Unknown or not iOS
zh_cn: 未知 或 非 iOS

source: Unlike arctan() the function arctan2(y, x) is valid for all angles and so may be used to convert a vector to an angle without risking division by zero, and it also returns a result in the correct quadrant.
zh_cn: 与arctan()不同，函数arctan2(y，x)对所有角度都有效，因此可用于将向量转换为角度，而不会有被零除的风险，并且它还会返回正确象限中的结果。

source: Unlike darctan() the function darctan2() is valid for all angles and so may be used to convert a vector to an angle without risking division by zero, and it also returns a result in the correct quadrant.
zh_cn: 与darctan()不同，函数darctan2()对所有角度都有效，因此可用于将向量转换为角度，而不会有被零除的风险，并且它还会返回正确象限中的结果。

source: Unlike hspeed and vspeed, speed has no direction associated with it as this is governed by the direction value of the instance, but it can have a negative value, in which case the instance will travel in the opposite direction to that set by the direction function (ie: direction - 180°).
zh_cn: 与hspeed和vspeed不同，speed没有关联的方向，因为它由实例的方向值控制，但它可以有负值，在这种情况下，实例将沿与方向函数设置的方向相反的方向移动(即:方向- 180)。

source: Unlike the function buffer_base64_decode(), this will not create a buffer for you, but rather you should already have created the buffer (see buffer_create()), the id of which you would then use with this function.
zh_cn: 与buffer_base64_decode()函数不同，它不会为您创建缓冲区，而是您应该已经创建了缓冲区(请参见buffer_create())，然后您将在此函数中使用该缓冲区的id。

source: Unlike the keyboard_check() function, this function will only run once for every time the key is lifted, so for it to trigger again, the key must be first pressed and then released again.
zh_cn: 与keyboard_check()函数不同，此函数在每次举起键时只会运行一次，因此要再次触发它，必须先按下键，然后再释放键。

source: Unlike the keyboard_check() function, this function will only run once for every time the key is pressed down, so for it to trigger again, the key must be first released and then pressed again.
zh_cn: 与keyboard_check()函数不同，此函数在每次按下键时只会运行一次，因此要再次触发该键，必须先释放该键，然后再按一次。

source: Unlike the keyboard_check_pressed() or keyboard_check_released() functions which are only triggered once when the key is pressed or released, this function is triggered every step that the key is held down for.
zh_cn: 与keyboard_check_pressed()或keyboard_check_released()函数不同，这两个函数只在按键被按下或释放时触发一次，此函数在按键被按下的每一步都会被触发。

source: Unlike the normal font_add_sprite() which has a specific order for the sub-images of the sprite, this function will map the sprite sub-images based on the argument "string_map" of the function.
zh_cn: 与普通的font_add_sprite()不同，它对子画面的子图像有特定的顺序，此函数将根据函数的参数"string_map"映射子画面。

source: Use multiple to create a smoke cloud.
zh_cn: 使用多个来创建烟雾云。

source: Use the File functions instead to create a custom save system where you only save and load specific game data.
zh_cn: 使用File函数来创建一个自定义的保存系统，只保存和加载特定的游戏数据。

source: Use this to allow the instance to rotate on the spot when no path is found (true) or not (false)
zh_cn: 使用它来允许实例在找不到路径时原地旋转 (true) 或未找到 (false)

source: Use to indicate the number of sub-images (1 for a single image or for a *.gif).
zh_cn: 用于指示子图像的数量(1表示单个图像，1表示*。gif)。

source: Used to set/get the flip bit of a tile data blob.
zh_cn: 用于设置/获取图块数据blob翻转位。

source: Used to set/get the mirror bit of a tile data blob.
zh_cn: 用于设置/获取图块数据blob镜像位。

source: Used to set/get the rotate bit of a tile data blob.
zh_cn: 用于设置/获取图块数据blob旋转位。

source: Using it in any other event may not work as expected, and may give different results across different targets and even devices.
zh_cn: 在任何其他事件中使用它可能不会像预期的那样工作，并且可能在不同的目标甚至设备上给出不同的结果。

source: Using this function returns the name part of the indicated file, with the extension but without the path
zh_cn: 使用此函数返回指定文件的名称部分，带扩展名，不带路径

source: Using this function returns the path part of the indicated file path, including the final backslash.
zh_cn: 使用此函数返回指定文件路径的路径部分，包括最后一个反斜杠。

source: Using this function you can change the angle for the given sprite element on a layer.
zh_cn: 使用此函数，你可以改变一个层上给定精灵元素的角度。

source: Using this function you can change the sprite resource assigned to a given sprite element on a layer.
zh_cn: 使用此函数，你可以改变分配给特定层上精灵元素的精灵资源。

source: Using this function you can change the tile set resource assigned to a given tile map element on a layer.
zh_cn: 通过此函数，您可以更改分配给图层上给定切片地图元素的切片集资源。

source: Using this function you can change whether the given background element on a layer should be tiled horizontally or not.
zh_cn: 使用此函数，你可以改变一个图层上的背景元素是否应该水平平铺。

source: Using this function you can change whether the given background element on a layer should be tiled vertically or not.
zh_cn: 使用此函数，你可以改变一个图层上的背景元素是否应该垂直平铺。

source: Using this function you can change whether the given sprite element on a layer should be scaled along the x axis or not.
zh_cn: 使用此函数，你可以改变一个层上的精灵元素是否应该沿着x轴缩放。

source: Using this function you can change whether the given sprite element on a layer should be scaled along the y axis or not.
zh_cn: 使用此函数你可以改变一个层上给定的精灵元素是否应该沿着y轴缩放。

source: Using this function you can clear/set all the tiles on a given tile-map.
zh_cn: 使用此函数你可以清除/设置一个给定tiles上的所有tile-map。

source: Using this function you can retrieve the height (in cells) of the tile map element.
zh_cn: 使用此函数，您可以检索tile map元素的高度(以单元格为单位)。

source: Using this function you can retrieve the height (in pixels) of each tile cell of the tile map element.
zh_cn: 使用此函数，您可以检索tile map元素的每个图格的高度(以像素为单位)。
